engr-ping/AUTOSAR_CP_CODE/src/bsw/OnBoardDevices/Tle9210x/Tle9210x.c
/*****************************************************************************************************************
******************************************************************************************************************
*  Copyright (C) .                                                                            
*  All rights reserved.                                                                                           
******************************************************************************************************************
*  FileName: Tle9210x                                                                                             
*  Content:  Tle9210x family drive
*  Category: Tle92104 Tle92108
******************************************************************************************************************
*  Revision Management                                                                                            
*  yyyy.mm.dd    name              version      description                                                       
*  ----------    --------          -------      -----------------------------------                               
*  2022.03.30    clipping            v0001        Frist edit                                                        
******************************************************************************************************************
******************************************************************************************************************/
/* Include Headerfiles  */
#include "Tle9210x.h"
#include "Pfm.h"
#include "Spi.h"
#include "LiBool.h"
#include "Pwm.h"

static boolean sTle9210x_abREGBANKSts[TLE9210X_GROUP_MAX][TLE9210X_CHIP_MAX];
static uint8 sTle9210x_au8GlobalStatus[TLE9210X_GROUP_MAX][TLE9210X_CHIP_MAX];
static uint8 sTle9210x_au8PwmDuty[TLE9210X_GROUP_MAX][TLE9210X_CHIP_MAX][TLE9210X_PWM_CHN_MAX];
static uint8 sTle9210x_au8HbOutSts[TLE9210X_GROUP_MAX][TLE9210X_CHIP_MAX][TLE9210X_HB_CHN_MAX];
static PFM_DefectReportState_t sTle9210x_atDiagResult[TLE9210X_GROUP_MAX][TLE9210X_CHIP_MAX][TLE9210X_HB_CHN_MAX];

static uint8 sTle9210x_au8ChipMode[TLE9210X_GROUP_MAX][TLE9210X_CHIP_MAX];
static uint16 sTle9210x_au16GenCtrl1[TLE9210X_GROUP_MAX][TLE9210X_CHIP_MAX];
static uint16 sTle9210x_au16GenCtrl2[TLE9210X_GROUP_MAX][TLE9210X_CHIP_MAX];

static Tle9210x_GenStsRegType sTle9210x_atGenStsReport[TLE9210X_GROUP_MAX][TLE9210X_CHIP_MAX];

static void Tle9210x_WriteReg(uint8 u8GroupId,uint8* pu8RegBuf, uint16* pu16WtData);
static void Tle9210x_ReadReg( uint8 u8GroupId,uint8* pu8RegBuf,uint16* pu16ReadBuf);
static void Tle9210x_SetChipMode(uint8 u8GroupId,uint8 u8Mode);
static void Tle9210x_GetChipMode(uint8 u8GroupId,uint8 u8ChipId,uint8* pu8Mode);
static void Tle9210x_SetGenCtrlReg(uint8 u8Group);
/****************************************************************************************
| NAME:    Tle9210x_WriteReg
| CALLED BY:
| PRECONDITIONS:     NA
| INPUT PARAMETERS:    uint16 buf
| RETURN VALUE:     void
| DESCRIPTION:      recovery tle941xy output (overload)
****************************************************************************************/
static void Tle9210x_WriteReg(uint8 u8GroupId,uint8* pu8RegBuf, uint16* pu16WtData)
{
    uint8 l_u8ChipIndex;
    uint8 l_u8ChipNum;
    uint8 l_au8RcvDataBuf[TLE9210X_CHIP_MAX * 3] = {0};
    uint8 l_au8SndDataBuf[TLE9210X_CHIP_MAX * 3] = {0};

    l_u8ChipNum = *cTle9210x_atGroupCfg[u8GroupId].pu8ChipNum;

    if(l_u8ChipNum > 0u)
    {
        /* Reversal data buffer */
        for(l_u8ChipIndex = 0u; l_u8ChipIndex < l_u8ChipNum; l_u8ChipIndex++)
        {
            l_au8SndDataBuf[3*l_u8ChipNum - l_u8ChipIndex] =(uint8)(TLE9210X_BASE_ADDR 
                                            | (uint8)(TLE9210X_LABT_OFF << 7u) 
                                            | (uint8)(pu8RegBuf[(l_u8ChipIndex)] << 1u) 
                                            | TLE9210X_OP_RW_OR_R1C);
            l_au8SndDataBuf[2*l_u8ChipIndex] = pu16WtData[l_u8ChipIndex] ;
            l_au8SndDataBuf[2*l_u8ChipIndex + 1u] = (uint8)(pu16WtData[l_u8ChipIndex] >> 8u);
        }
        /****The last chip control LABT is 1 whether it is daisy chain communication or not********/
        l_au8SndDataBuf[2*l_u8ChipNum + 1u] |= (TLE9210X_LABT_ON << 7u);

        /* Send Read  */
        (void)Spi_SetupEB(cTle9210x_atGroupCfg[u8GroupId].SpiChannel, &l_au8SndDataBuf[0], &l_au8RcvDataBuf[0], (l_u8ChipNum * 3));

        (void)Spi_SyncTransmit(cTle9210x_atGroupCfg[u8GroupId].SpiSequence);

        for(l_u8ChipIndex = 0u; l_u8ChipIndex < l_u8ChipNum; l_u8ChipIndex++)
        {
            sTle9210x_au8GlobalStatus[u8GroupId][l_u8ChipIndex] = l_au8RcvDataBuf[(3u * l_u8ChipNum - l_u8ChipIndex - 1u)];
        }
    }
    else
    {

    }
}

/****************************************************************************************
| NAME:    Tle9210x_ReadReg
| CALLED BY:
| PRECONDITIONS:     NA
| INPUT PARAMETERS:    uint16 buf
| RETURN VALUE:     uint16
| DESCRIPTION:      recovery tle941xy output (overload)
****************************************************************************************/
static void Tle9210x_ReadReg( uint8 u8GroupId,uint8* pu8RegBuf,uint16* pu16ReadBuf)
{

    uint8 l_u8ChipIndex;
    uint8 l_u8ChipNum;
    uint16 l_au8RcvDataBuf[TLE9210X_CHIP_MAX * 3u] = {0};
    uint16 l_au8SndDataBuf[TLE9210X_CHIP_MAX * 3u] = {0};

    l_u8ChipNum = *cTle9210x_atGroupCfg[u8GroupId].pu8ChipNum;

    if(l_u8ChipNum > 0u)
    {
        /* Reversal data buffer */
        for(l_u8ChipIndex = 0u; l_u8ChipIndex < l_u8ChipNum; l_u8ChipIndex++)
        {
            l_au8SndDataBuf[3*l_u8ChipNum - l_u8ChipIndex] =(uint8)(TLE9210X_BASE_ADDR 
                                            | (uint8)(TLE9210X_LABT_OFF << 7u) 
                                            | (uint8)(pu8RegBuf[(l_u8ChipIndex)] << 1u) 
                                            | TLE9210X_OP_READ_ONLY);
        }
        /****The last chip control LABT is 1 whether it is daisy chain communication or not********/
        l_au8SndDataBuf[2*l_u8ChipNum + 1u] |= (uint8)(TLE9210X_LABT_ON << 7u);

        /* Send Read  */
        (void)Spi_SetupEB(cTle9210x_atGroupCfg[u8GroupId].SpiChannel, &l_au8SndDataBuf[0], &l_au8RcvDataBuf[0], (l_u8ChipNum * 2u));

        (void)Spi_SyncTransmit(cTle9210x_atGroupCfg[u8GroupId].SpiSequence);

        for(l_u8ChipIndex = 0u; l_u8ChipIndex < l_u8ChipNum; l_u8ChipIndex++)
        {
            pu16ReadBuf[l_u8ChipIndex] = (uint16)(l_au8RcvDataBuf[l_u8ChipNum * 2u + 1u] << 8u) + l_au8RcvDataBuf[l_u8ChipNum * 2u];
            sTle9210x_au8GlobalStatus[u8GroupId][l_u8ChipIndex] = l_au8RcvDataBuf[(3u*l_u8ChipNum - l_u8ChipIndex - 1u)];
        }
    }
    else
    {

