engr-ping/AUTOSAR_CP_CODE/src/bsw/OnBoardDevices/Tle9210x/Tle9210x.c
    }

}


static void Tle9210x_SetChipMode(uint8 u8GroupId,uint8 u8Mode)
{
    uint8 j;
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle9210x_atGroupCfg[u8GroupId].pu8ChipNum;
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        switch(u8Mode)
        {
            case TLE9210X_MODE_SLEEP:
                {
                    Dio_WriteChannel(cTle9210x_atChipCfg[u8GroupId][j].u8EnPinCtrl, STD_OFF);
                    sTle9210x_au8ChipMode[u8GroupId][j] = TLE9210X_MODE_SLEEP;
                }
                break;
            case TLE9210X_MODE_NORMAL:
                Dio_WriteChannel(cTle9210x_atChipCfg[u8GroupId][j].u8EnPinCtrl, STD_ON);
                sTle9210x_au8ChipMode[u8GroupId][j] = TLE9210X_MODE_NORMAL;
                break;
            case TLE9210X_MODE_FAIL_SAFE:
                Dio_WriteChannel(cTle9210x_atChipCfg[u8GroupId][j].u8EnPinCtrl, STD_ON);
                sTle9210x_au8ChipMode[u8GroupId][j] = TLE9210X_MODE_FAIL_SAFE;
                break;
            default:
                Dio_WriteChannel(cTle9210x_atChipCfg[u8GroupId][j].u8EnPinCtrl, STD_ON);
                sTle9210x_au8ChipMode[u8GroupId][j] = TLE9210X_MODE_NORMAL;
                break;
        }
    }
}

static void Tle9210x_GetChipMode(uint8 u8GroupId,uint8 u8ChipId,uint8* pu8Mode)
{
    *pu8Mode = sTle9210x_au8ChipMode[u8GroupId][u8ChipId];
}

static void Tle9210x_SetGenCtrlReg(uint8 u8Group)
{

    uint8 j;
    uint8 l_au8RegBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_au16DataBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle9210x_atGroupCfg[u8Group].pu8ChipNum;

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_GENCTRL1;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au16DataBuf[j] &= 0xfdfdu;
        l_au16DataBuf[j] |= ((uint16)(cTle9210x_atChipCfg[u8Group][j].REG_BANK << 9u)
                        | (uint16)(cTle9210x_atChipCfg[u8Group][j].WDPER << 1u));
        sTle9210x_au16GenCtrl1[u8Group][j] = l_au16DataBuf[j];
        sTle9210x_abREGBANKSts[u8Group][j] = cTle9210x_atChipCfg[u8Group][j].REG_BANK;
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_GENCTRL2;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au16DataBuf[j] &= 0xfdffu;
        l_au16DataBuf[j] |= (uint16)(cTle9210x_atChipCfg[u8Group][j].WDDIS << 9u);
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);

}

static void Tle9210x_SetVDSReg(uint8 u8Group)
{
    uint8 j;
    uint8 l_au8RegBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_au16DataBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle9210x_atGroupCfg[u8Group].pu8ChipNum;

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_VDS1;
        l_au16DataBuf[j] |= ((cTle9210x_atHbChnCfg[u8Group][j][0].u8HBDrainSrcOv)
                |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][1].u8HBDrainSrcOv << 3u)
                |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][2].u8HBDrainSrcOv << 6u)
                |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][3].u8HBDrainSrcOv << 9u)
                |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][0].bHBDrainSrcMonit << 12u)
                |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][0].bHBDrainSrcMonit << 13u)
                |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][0].bHBDrainSrcMonit << 14u)
                |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][0].bHBDrainSrcMonit << 15u));
    }

    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);

#if(TLE9210X_TLE92108_CHIP_EN == STD_ON)
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_VDS2;

        l_au16DataBuf[j] |= ((cTle9210x_atHbChnCfg[u8Group][j][4].u8HBDrainSrcOv)
        |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][5].u8HBDrainSrcOv << 3u)
        |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][6].u8HBDrainSrcOv << 6u)
        |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][7].u8HBDrainSrcOv << 9u)
        |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][4].bHBDrainSrcMonit << 12u)
        |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][5].bHBDrainSrcMonit << 13u)
        |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][6].bHBDrainSrcMonit << 14u)
        |(uint16)(cTle9210x_atHbChnCfg[u8Group][j][7].bHBDrainSrcMonit << 15u));
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);
#endif

}

static void Tle9210x_SetHbOutputReg(uint8 u8Group)
{

    uint8 j;
    uint8 l_au8RegBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_au16DataBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle9210x_atGroupCfg[u8Group].pu8ChipNum;
    /***OUT1-OUT4**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_HBMODE;
        l_au16DataBuf[j] = (sTle9210x_au8HbOutSts[u8Group][j][0] 
                        | (uint8)(sTle9210x_au8HbOutSts[u8Group][j][1] << 2u)
                        | (uint8)(sTle9210x_au8HbOutSts[u8Group][j][2] << 4u)
                        | (uint8)(sTle9210x_au8HbOutSts[u8Group][j][3] << 6u)
                        | (uint8)(sTle9210x_au8HbOutSts[u8Group][j][4] << 8u)
                        | (uint8)(sTle9210x_au8HbOutSts[u8Group][j][5] << 10u)
                        | (uint8)(sTle9210x_au8HbOutSts[u8Group][j][6] << 12u)
                        | (uint8)(sTle9210x_au8HbOutSts[u8Group][j][7] << 14u));
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);

}

static void Tle9210x_SetPwmActOrFw(uint8 u8Group)
{
    uint8 j;
    uint8 l_au8RegBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_au16DataBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle9210x_atGroupCfg[u8Group].pu8ChipNum;
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        if(sTle9210x_abREGBANKSts[u8Group][j] == TLE9210X_REG_BANK_OFF)
        {
            l_au8RegBuf[j] = TLE9210X_CCP_BLK2_ACT;
        }
        else
        {
            l_au8RegBuf[j] = TLE9210X_CCP_BLK2_FW;
        }
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);

