engr-ping/AUTOSAR_CP_CODE/src/bsw/OnBoardDevices/Tle9210x/Tle9210x.c
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        if(sTle9210x_abREGBANKSts[u8Group][j] == TLE9210X_REG_BANK_OFF)
        {
            l_au8RegBuf[j] = TLE9210X_ST_ICHG;
        }
        else
        {
            l_au8RegBuf[j] = TLE9210X_PWM_PCHG_INIT;
        }
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        if(sTle9210x_abREGBANKSts[u8Group][j] == TLE9210X_REG_BANK_OFF)
        {
            l_au8RegBuf[j] = TLE9210X_PWM_ICHG_ACT;
        }
        else
        {
            l_au8RegBuf[j] = TLE9210X_PWM_ICHG_FW;
        }
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        if(sTle9210x_abREGBANKSts[u8Group][j] == TLE9210X_REG_BANK_OFF)
        {
            l_au8RegBuf[j] = TLE9210X_PWM_IDCHG_ACT;
        }
        else
        {
            l_au8RegBuf[j] = TLE9210X_PWM_PDCHG_INIT;
        }
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        if(sTle9210x_abREGBANKSts[u8Group][j] == TLE9210X_REG_BANK_OFF)
        {
            l_au8RegBuf[j] = TLE9210X_PWM_ICHGMAX_CCP_BLK3_ACT;
        }
        else
        {
            l_au8RegBuf[j] = TLE9210X_PWM_ICHGMAX_CCP_BLK3_FW;
        }
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);
}

static void Tle9210x_SetRegBank(uint8 u8Group,boolean bEn)
{
    uint8 j;
    uint8 l_au8RegBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_au16DataBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle9210x_atGroupCfg[u8Group].pu8ChipNum;

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_GENCTRL1;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        if(TRUE == bEn)
        {
            SETBIT_U16(l_au16DataBuf[j],9u);
            sTle9210x_abREGBANKSts[u8Group][j] = TLE9210X_REG_BANK_ON;
        }
        else
        {
            CLRBIT_U16(l_au16DataBuf[j],9u);
            sTle9210x_abREGBANKSts[u8Group][j] = TLE9210X_REG_BANK_OFF;
        }
    }

    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);
}

static void Tle9210x_SetPwmMappingReg(uint8 u8Group)
{
    uint8 j;
    uint8 l_au8RegBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_au16DataBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;
    Tle9210x_SetRegBank(u8Group,TLE9210X_REG_BANK_OFF);
    l_u8ChipNum = *cTle9210x_atGroupCfg[u8Group].pu8ChipNum;
    /***OUT1-OUT4**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_PWMSET;
        l_au16DataBuf[j] = (cTle9210x_atPwmChnCfg[u8Group][j][0].bPwmEn
                        | (uint16)(cTle9210x_atPwmChnCfg[u8Group][j][0].u8PwmMapChn << 1u)
                        | (uint16)(cTle9210x_atPwmChnCfg[u8Group][j][1].bPwmEn << 4u)
                        | (uint16)(cTle9210x_atPwmChnCfg[u8Group][j][1].u8PwmMapChn << 5u)
                        | (uint16)(cTle9210x_atPwmChnCfg[u8Group][j][2].bPwmEn << 8u)
                        | (uint16)(cTle9210x_atPwmChnCfg[u8Group][j][2].u8PwmMapChn << 9u));
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);

}

static void Tle9210x_SetPwmDelayTimeReg(uint8 u8Group)
{
    uint8 j;
    uint8 l_au8RegBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_au16DataBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;
    uint8 l_u8ErrCnt;
    uint8 l_u8RetVal;

    l_u8ChipNum = *cTle9210x_atGroupCfg[u8Group].pu8ChipNum;
    /***PWM1**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_TDON_OFF1;
        l_au16DataBuf[j] = (cTle9210x_atPwmChnCfg[u8Group][j][0].u8TurnOnTime
                        | (uint16)(cTle9210x_atPwmChnCfg[u8Group][j][0].u8TurnOffTime << 8u));
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);

    /***PWM2**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_TDON_OFF2;
        l_au16DataBuf[j] = (cTle9210x_atPwmChnCfg[u8Group][j][1].u8TurnOnTime
                        | (uint16)(cTle9210x_atPwmChnCfg[u8Group][j][1].u8TurnOffTime << 8u));
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);

    /***PWM3**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_TDON_OFF3;
        l_au16DataBuf[j] = (cTle9210x_atPwmChnCfg[u8Group][j][2].u8TurnOnTime
                        | (uint16)(cTle9210x_atPwmChnCfg[u8Group][j][2].u8TurnOffTime << 8u));
    }
    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);

}

static void Tle9210x_GetAllGenSts(uint8 u8Group)
{
    uint8 j;
    uint8 l_au8RegBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_au16DataBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle9210x_atGroupCfg[u8Group].pu8ChipNum;

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_GENSTAT;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        sTle9210x_atGenStsReport[u8Group][j].u16GENSTAT = l_au16DataBuf[j];
    }

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_DSOV;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        sTle9210x_atGenStsReport[u8Group][j].u16DSOV = l_au16DataBuf[j];
    }

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_HBVOUT_PWMERR;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        sTle9210x_atGenStsReport[u8Group][j].u16HBVOUT_PWMERR = l_au16DataBuf[j];
    }

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_EFF_TDON_OFF1;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        sTle9210x_atGenStsReport[u8Group][j].u16EFF_TDON_OFF1 = l_au16DataBuf[j];
    }

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_EFF_TDON_OFF2;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        sTle9210x_atGenStsReport[u8Group][j].u16EFF_TDON_OFF2 = l_au16DataBuf[j];
    }

