engr-ping/AUTOSAR_CP_CODE/src/bsw/OnBoardDevices/Tle9210x/Tle9210x.c
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_EFF_TDON_OFF3;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        sTle9210x_atGenStsReport[u8Group][j].u16EFF_TDON_OFF3 = l_au16DataBuf[j];
    }

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_TRISE_FALL1;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        sTle9210x_atGenStsReport[u8Group][j].u16TRISE_FALL1 = l_au16DataBuf[j];
    }

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_TRISE_FALL2;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        sTle9210x_atGenStsReport[u8Group][j].u16TRISE_FALL2 = l_au16DataBuf[j];
    }

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_TRISE_FALL3;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        sTle9210x_atGenStsReport[u8Group][j].u16TRISE_FALL3 = l_au16DataBuf[j];
    }

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_DEVID;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        sTle9210x_atGenStsReport[u8Group][j].u16DEVID = l_au16DataBuf[j];
    }
}

static void Tle9210x_OVDiagnostic(uint8 u8Group)
{
    uint8 j;
    uint8 k;
    uint8 l_u8Chn;
    uint8 l_au8RegBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_au16DataBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;
    uint8 l_u8ErrCnt;

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_DSOV;
    }
    Tle9210x_ReadReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        sTle9210x_atGenStsReport[u8Group][j].u16DSOV = l_au16DataBuf[j];
        for(k = 0u;k < 16u;k + 2u)
        {
            l_u8Chn = (uint8)(k/2u);
            sTle9210x_atDiagResult[u8Group][j][l_u8Chn].eShort2Vcc = 
                (TRUE == (GETBIT_U16(sTle9210x_atGenStsReport[u8Group][j].u16DSOV,k)
                ||GETBIT_U16(sTle9210x_atGenStsReport[u8Group][j].u16DSOV,(k+1u))))
                ? PFM_DDS_POS : PFM_DDS_NEG;
        }
        if(l_au16DataBuf[j] > 0u)
        {
            l_u8ErrCnt++;
        }
        else
        {
            /*Nothing to do*/
        }
    }
    if(l_u8ErrCnt > 0u)
    {
        memset(l_au16DataBuf,0u,sizeof(l_au16DataBuf));
        Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);
    }
}

static void Tle9210x_SetPwmDutyOut(uint8 u8Group)
{
    uint8 j;
    uint8 k;
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle9210x_atGroupCfg[u8Group].pu8ChipNum;
    /***PWM1 - PWM3**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        for(k = 0u;k < 3u; k++)
        {
            if(cTle9210x_atPwmChnCfg[u8Group][j][0].bPwmEn == TLE9210X_PWM_ENABLE)
            {
                Pwm_SetDutyCycle(cTle9210x_atPwmChnCfg[u8Group][j][0].u8PwmChn,
                    sTle9210x_au8PwmDuty[u8Group][j][0]);
            }
        }
    }
}

void Tle9210x_Init(void)
{
    uint8 i;

    memset(sTle9210x_au8HbOutSts,0u,sizeof(sTle9210x_au8HbOutSts));

    for(i = 0u;i < TLE9210X_GROUP_MAX;i++)
    {
        Tle9210x_SetChipMode(i,TLE9210X_MODE_NORMAL);
        Tle9210x_SetGenCtrlReg(i);
        Tle9210x_SetPwmMappingReg(i);
        Tle9210x_SetPwmDelayTimeReg(i);
        Tle9210x_GetAllGenSts(i);
        Tle9210x_SetVDSReg(i);

        Tle9210x_SetHbOutputReg(i);
    }
}


void Tle9210x_MainFunction(void)
{
    uint8 i;

    for(i = 0u;i < TLE9210X_GROUP_MAX;i++)
    {
        Tle9210x_OVDiagnostic(i);
        Tle9210x_SetHbOutputReg(i);
        Tle9210x_SetPwmDutyOut(i);
    }
}

void Tle9210x_DeInit(void)
{
    uint8 i;

    memset(sTle9210x_au8HbOutSts,0u,sizeof(sTle9210x_au8HbOutSts));
    memset(sTle9210x_au8PwmDuty,0u,sizeof(sTle9210x_au8PwmDuty));
    for(i = 0u;i < TLE9210X_GROUP_MAX;i++)
    {
        Tle9210x_SetHbOutputReg(i);
        Tle9210x_SetPwmDutyOut(i);
    }
}

void Tle9210x_WriteHbChn(uint8 u8GroupId, uint8 u8ChipId,uint8 u8ChnId, uint8 u8Val)
{
    if((u8GroupId < (uint8)TLE9210X_GROUP_MAX)
    &&(u8ChipId < (uint8)TLE9210X_CHIP_MAX)
    &&(u8ChnId < (uint8)TLE9210X_HB_CHN_MAX))
    {
        sTle9210x_au8HbOutSts[u8GroupId][u8ChipId][u8ChnId] = u8Val;
    }
}

void Tle9210x_WritePwmChn(uint8 u8GroupId, uint8 u8ChipId,uint8 u8PwmChn, uint8 u8Val)
{
    if((u8GroupId < (uint8)TLE9210X_GROUP_MAX)
    &&(u8ChipId < (uint8)TLE9210X_CHIP_MAX)
    &&(u8PwmChn < (uint8)TLE9210X_PWM_CHN_MAX))
    {
        sTle9210x_au8PwmDuty[u8GroupId][u8ChipId][u8PwmChn] = u8Val;
    }
}

void Tle9210x_TriggerWdg(uint8 u8Group)
{

    uint8 j;
    uint8 l_au8RegBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_au16DataBuf[TLE9210X_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle9210x_atGroupCfg[u8Group].pu8ChipNum;

    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE9210X_GENCTRL1;

        if((sTle9210x_au16GenCtrl1[u8Group][j]  & 0x0001) == 0x0001u)
        {
            sTle9210x_au16GenCtrl1[u8Group][j] &= 0xfffeu;
        }
        else
        {
            sTle9210x_au16GenCtrl1[u8Group][j] |= 0x0001u;
        }
        l_au16DataBuf[j] = sTle9210x_au16GenCtrl1[u8Group][j];
    }

    Tle9210x_WriteReg(u8Group,l_au8RegBuf,l_au16DataBuf);
}


Std_ReturnType Tle9210x_SetPwmDutyCycle(uint8 ChannelId, uint8 DutyCycle)
{
    Std_ReturnType l_u8RetVal = E_OK;

    Tle9210x_PwmChnIdType* pu8PwmChnId= NULL;
    if(ChannelId >= TLE9210X_PWM_CHANNEL_MAX)
    {
        pu8PwmChnId = &gTle9210x_PwmChnId[ChannelId];
        Tle9210x_WritePwmChn(pu8PwmChnId->u8GroupId, pu8PwmChnId->u8ChipId, pu8PwmChnId->u8PwmChn, DutyCycle);
    }
    else
    {
        l_u8RetVal = E_NOT_OK;
    }
    return l_u8RetVal;
}

Std_ReturnType Tle9210x_WriteHbChannel(uint8 ChannelId, uint8 Value)
{
    Std_ReturnType l_u8RetVal = E_OK;

    Tle9210x_HbChnIdType* pu8HbChnId= NULL;
    if(ChannelId >= TLE9210X_HB_CHANNEL_MAX)
    {
        pu8HbChnId = &gTle9210x_HbChnId[ChannelId];
        Tle9210x_WriteHbChn(pu8HbChnId->u8GroupId, pu8HbChnId->u8ChipId, pu8HbChnId->u8HbChn, Value);
    }
    else
    {
        l_u8RetVal = E_NOT_OK;
    }
    return l_u8RetVal;
}